# Taps
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"

# Brew
brew "antidote"
brew "automake"
brew "awk"
brew "bash"
brew "bash-completion"
brew "openssl@3"
brew "bat"
brew "python"
brew "black"
brew "bpytop"
brew "brew-cask-completion"
brew "brew-gem"
brew "gcc"
brew "btop"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "diff-so-fancy"
brew "eza"
brew "fd"
brew "gettext"
brew "gh"
brew "git"
brew "go"
brew "helix"
brew "htop"
brew "jq"
brew "lazygit"
brew "libidn2"
brew "libuv"
brew "llvm"
brew "lua-language-server"
brew "luarocks"
brew "luv"
brew "neovim"
brew "node"
brew "openssh"
brew "pyenv"
brew "pylint"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "shellcheck"
brew "ssh-copy-id"
brew "stow"
brew "tmux"
brew "tree"
brew "wget"
brew "xclip"
brew "youtube-dl"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Cask
cask "font-3270-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-source-code-pro"
cask "font-ubuntu-mono-nerd-font"
cask "iterm2"
cask "rar"
cask "google-chrome"
cask "google-drive"
cask "vlc"
cask "sublime-text"
cask "rectangle"
cask "visual-studio-code"

# mas install

# vscode --install-extension
vscode "codeium.codeium"
vscode "eamodio.gitlens"
vscode "freecodecamp.freecodecamp-dark-vscode-theme"
vscode "github.github-vscode-theme"
vscode "jeff-hykin.better-cpp-syntax"
vscode "josetr.cmake-language-support-vscode"
vscode "koihik.vscode-lua-format"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
