# ███████████                                        ██████   ███  ████
# ░░███░░░░░███                                      ███░░███ ░░░  ░░███
#  ░███    ░███ ████████   ██████  █████ ███ █████  ░███ ░░░  ████  ░███   ██████
#  ░██████████ ░░███░░███ ███░░███░░███ ░███░░███  ███████   ░░███  ░███  ███░░███
#  ░███░░░░░███ ░███ ░░░ ░███████  ░███ ░███ ░███ ░░░███░     ░███  ░███ ░███████
#  ░███    ░███ ░███     ░███░░░   ░░███████████    ░███      ░███  ░███ ░███░░░
#  ███████████  █████    ░░██████   ░░████░████     █████     █████ █████░░██████
# ░░░░░░░░░░░  ░░░░░      ░░░░░░     ░░░░ ░░░░     ░░░░░     ░░░░░ ░░░░░  ░░░░░░
#
#  ▓▓▓▓▓▓▓▓▓▓
# ░▓ author ▓ Akash Goyal
# ░▓ file   ▓ packages/Brewfile
# ░▓▓▓▓▓▓▓▓▓▓
# ░░░░░░░░░░

###############################################################
# Brewfile - Software Installs for macOS and Linux          #
#                                                            #
# Organized by category, sorted alphabetically              #
# Comment out anything you don't need                       #
###############################################################

#############################################################
# Taps                                                      #
#############################################################
tap "jandedobbeleer/oh-my-posh"
tap "github/gh"
tap "kyoh86/tap"

if OS.mac?
    tap "FelixKratz/formulae"
    tap "buo/cask-upgrade"
end

#############################################################
# Core Utilities (Both macOS and Linux)                    #
#############################################################

# Essential CLI Tools
brew "bat"                  # Cat with syntax highlighting (Rust)
brew "eza"                  # Better ls (Rust)
brew "fd"                   # Better find (Rust)
brew "fzf"                  # Fuzzy finder (Go)
brew "gh"                   # GitHub CLI
brew "git-delta"            # Better git diff (Rust)
brew "git-extras"           # Extra git commands
brew "git-lfs"              # Git Large File Storage
brew "jq"                   # JSON processor
brew "ripgrep"              # Better grep (Rust)
brew "sd"                   # Better sed (Rust)
brew "tree"                 # Directory tree
brew "zoxide"               # Smart cd (Rust)

# System Monitoring
brew "bmon"                 # Bandwidth monitor
brew "btop"                 # System monitor
brew "ctop"                 # Container metrics (Go)
brew "dua-cli"              # Disk usage analyzer
brew "duf"                  # Better df (Go)
brew "htop"                 # Process viewer
brew "procs"                # Better ps (Rust)

# Editors
brew "helix"                # Modern text editor (Rust)
brew "neovim"               # Vim-based text editor

# Shell & Prompt
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "zsh-autopair"

#############################################################
# Development Tools                                         #
#############################################################

# Build Tools
brew "automake"
brew "cmake"

# Version Control & Tools
brew "diff-so-fancy"
brew "lazygit"              # Git TUI (Go)

# Programming Languages
brew "go"                   # Go programming language
brew "node"                 # Node.js
brew "python3"              # Python 3

# Language Tools - Python
brew "black"                # Python formatter
brew "pipx"                 # Python package installer
brew "pyenv"                # Python version manager
brew "pylint"               # Python linter
brew "python-lsp-server"    # Python LSP

# Language Tools - Lua
brew "lua"
brew "lua-language-server"
brew "luajit"
brew "luarocks"
brew "luv"
brew "stylua"               # Lua formatter

# Shell Tools
brew "shellcheck"           # Shell script linter
brew "shfmt"                # Shell formatter

# Other Tools
brew "ack"                  # Search tool
brew "grc"                  # Colorize output
brew "hexyl"                # Hex viewer (Rust)
brew "rsync"                # File sync
brew "sevenzip"             # 7-Zip archiver
brew "tldr"                 # Simplified man pages
brew "zstd"                 # Compression

#############################################################
# macOS Specific                                            #
#############################################################
if OS.mac?
    # Core Tools
    brew "coreutils"        # GNU core utilities
    brew "entr"             # File watcher
    brew "figlet"           # ASCII art
    brew "gcc"              # GNU compiler
    brew "lolcat"           # Rainbow text
    brew "mas"              # Mac App Store CLI
    brew "stow"             # Dotfile manager
    brew "trash"            # Safe rm

    # Programming Languages
    brew "rbenv"            # Ruby version manager
    brew "ruby"
    brew "ruby-build"
    brew "rust"
    brew "rustup"           # Rust version manager

    # Security
    brew "openssh"
    brew "openssl"
    brew "ssh-copy-id"
    brew "sshs"             # SSH TUI (Rust)

    # Development
    brew "brew-cask-completion"
    brew "cmake-docs"
    brew "editorconfig"
    brew "lld"              # LLVM linker
    brew "universal-ctags"

    # Nerd Fonts
    cask "font-3270-nerd-font"
    cask "font-fira-code-nerd-font"
    cask "font-jetbrains-mono-nerd-font"
    cask "font-meslo-lg-nerd-font"
    cask "font-source-code-pro"
    cask "font-symbols-only-nerd-font"
    cask "font-ubuntu-mono-nerd-font"
end

#############################################################
# Linux Specific                                            #
#############################################################
if OS.linux?
    brew "gettext"          # GNU i18n utilities
    brew "xclip"            # X11 clipboard
end
